In [1]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine("mysql+pymysql://nga:Simplon123!@localhost/simplon")
print("Connection est prete")

Connection est prete

In [2]:
#read donnee brut du fichier excel et les met dans df df_sondage
df_sondage = pd.read_excel('Jeux_de_donnees/Data_Professional_Salary_Survey_Responses_1.xlsx', sheet_name='Salary Survey')
df_sondage.head(4)

,Survey Year,Timestamp,SalaryUSD,Country,PostalCode,PrimaryDatabase,YearsWithThisDatabase,OtherDatabases,EmploymentStatus,JobTitle,...,NewestVersionInProduction,OldestVersionInProduction,PopulationOfLargestCityWithin20Miles,EmploymentSector,LookingForAnotherJob,CareerPlansThisYear,Gender,OtherJobDuties,KindsOfTasksPerformed,Counter
0,2021,2020-12-10 08:22:42.696,65000.0,Sweden,NaN,Microsoft SQL Server,4,Microsoft SQL Server,Full time employee,"Developer: Business Intelligence (SSRS, PowerB...",...,SQL Server 2016,SQL Server 2016,"<= 20,000 (town)",Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1
1,2021,2020-12-10 08:23:22.242,145000.0,United States,76063,Microsoft SQL Server,15,Azure SQL DB (any flavor),Full time employee,DBA (Production Focus - build & troubleshoot s...,...,SQL Server 2019,SQL Server 2014,1M+ (metropolis),Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1
2,2021,2020-12-10 08:23:37.909,105000.0,United States,43240,Microsoft SQL Server,12,"PostgreSQL, Azure SQL DB (any flavor)",Full time employee,DBA (General - splits time evenly between writ...,...,SQL Server 2017,SQL Server 2008R2,300K-1M (large city),Private business,Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1
3,2021,2020-12-10 08:23:48.152,46482.0,United Kingdom,NaN,Microsoft SQL Server,10,Azure SQL DB (any flavor),Full time employee,DBA (Production Focus - build & troubleshoot s...,...,SQL Server 2019,SQL Server 2012,300K-1M (large city),"Education (K-12, college, university)",Not Asked,"Stay with the same employer, same role",Male,Not Asked,Not Asked,1

In [3]:
columns_sondage = df_sondage.columns
columns_sondage

Index(['Survey Year', 'Timestamp', 'SalaryUSD', 'Country', 'PostalCode',
       'PrimaryDatabase', 'YearsWithThisDatabase', 'OtherDatabases',
       'EmploymentStatus', 'JobTitle', 'ManageStaff', 'YearsWithThisTypeOfJob',
       'HowManyCompanies', 'OtherPeopleOnYourTeam', 'CompanyEmployeesOverall',
       'DatabaseServers', 'Education', 'EducationIsComputerRelated',
       'Certifications', 'HoursWorkedPerWeek', 'TelecommuteDaysPerWeek',
       'NewestVersionInProduction', 'OldestVersionInProduction',
       'PopulationOfLargestCityWithin20Miles', 'EmploymentSector',
       'LookingForAnotherJob', 'CareerPlansThisYear', 'Gender',
       'OtherJobDuties', 'KindsOfTasksPerformed', 'Counter'],
      dtype='object')

In [4]:
#preparer les donnees à inserer dans la table sondage - year
data_year_sondage = df_sondage['Survey Year']
data_year_sondage = data_year_sondage.drop_duplicates()
data_year_sondage

0       2021
1747    2020
3470    2019
4349    2018
7443    2017
Name: Survey Year, dtype: int64

In [5]:
#créer un serie d'annee de sondage
Survey_Year = df_sondage["Survey Year"]
#créer df de serie Survey_Year, et nom du column est 'sdg_year'
#Attention: nom du col doit être meme nom du col dans DB
data_Survey_Year = pd.DataFrame({"sdg_year":Survey_Year})
data_Survey_Year = data_Survey_Year.drop_duplicates()
data_Survey_Year = data_Survey_Year.reset_index()
data_Survey_Year = data_Survey_Year.drop(columns=["index"])
data_Survey_Year = data_Survey_Year.reset_index()
data_Survey_Year = data_Survey_Year.rename(columns={"index":"sdg_id"})
data_Survey_Year.sdg_id = data_Survey_Year.sdg_id+1
data_Survey_Year

   sdg_id  sdg_year
0       1      2021
1       2      2020
2       3      2019
3       4      2018
4       5      2017

#inserer à table sondage

In [6]:

data_Survey_Year.to_sql('sondage', if_exists='append', con=engine, index=False)

In [7]:
result = pd.read_sql_query('SELECT * FROM sondage;', engine)
result

   sdg_id  sdg_year
0       1      2021
1       2      2020
2       3      2019
3       4      2018
4       5      2017

In [8]:
#preparer des données pour la table country
Country = df_sondage["Country"]
data_country = pd.DataFrame({"ctr_name":Country})
data_country = data_country.drop_duplicates()
data_country = data_country.reset_index()
data_country = data_country.drop(columns=["index"])
data_country = data_country.reset_index()
data_country = data_country.rename(columns={"index":"ctr_id"})
data_country.ctr_id = data_country.ctr_id+1
data_country

    ctr_id        ctr_name
0        1          Sweden
1        2   United States
2        3  United Kingdom
3        4        Pakistan
4        5        Paraguay
..     ...             ...
92      93         Albania
93      94         Bolivia
94      95         Vietnam
95      96         Bermuda
96      97           Kenya

[97 rows x 2 columns]

In [9]:
#inserer des donnees du df data_country
data_country.to_sql('country', if_exists='append', con=engine, index=False)

In [10]:
result_ctr = pd.read_sql_query('SELECT * FROM country;', engine)
result_ctr

    ctr_id        ctr_name
0        1          Sweden
1        2   United States
2        3  United Kingdom
3        4        Pakistan
4        5        Paraguay
..     ...             ...
92      93         Albania
93      94         Bolivia
94      95         Vietnam
95      96         Bermuda
96      97           Kenya

[97 rows x 2 columns]

In [11]:
#preparer les donnees à inserer dans la table database
#les donnees proviennent du col PrimaryDatabase
Database = df_sondage["PrimaryDatabase"]
data_Primary_Database = pd.DataFrame({'db_name': Database})
data_Primary_Database = data_Primary_Database.drop_duplicates()
data_Primary_Database = data_Primary_Database.reset_index()
data_Primary_Database = data_Primary_Database.drop(columns=["index"])
data_Primary_Database = data_Primary_Database.reset_index()
data_Primary_Database = data_Primary_Database.rename(columns={"index": "db_id"})
data_Primary_Database.db_id =data_Primary_Database.db_id+1
data_Primary_Database

    db_id                  db_name
0       1     Microsoft SQL Server
1       2               PostgreSQL
2       3                    Other
3       4             Azure SQL DB
4       5         Microsoft Access
5       6                   Oracle
6       7            MySQL/MariaDB
7       8  Amazon RDS (any flavor)
8       9                  MongoDB
9      10                      DB2
10     11                Cassandra
11     12                   SQLite
12     13                      SAP
13     14                 Teradata
14     15            Elasticsearch

In [12]:
#inserer à table database
data_Primary_Database.to_sql('database', if_exists='append', con=engine, index=False)

In [13]:
result_db = pd.read_sql_query('SELECT * FROM simplon.database', engine)
result_db

    db_id                  db_name
0       1     Microsoft SQL Server
1       2               PostgreSQL
2       3                    Other
3       4             Azure SQL DB
4       5         Microsoft Access
5       6                   Oracle
6       7            MySQL/MariaDB
7       8  Amazon RDS (any flavor)
8       9                  MongoDB
9      10                      DB2
10     11                Cassandra
11     12                   SQLite
12     13                      SAP
13     14                 Teradata
14     15            Elasticsearch

In [14]:
#prepare les données à inserer à table Education
#loc s/col Education de df_sondage (col de donnee brute)
Education = df_sondage['Education'] 
# creer DF de series Education, nom du col est le même du col dans DB
data_Education = pd.DataFrame({"edu_title": Education})
data_Education = data_Education.drop_duplicates()
data_Education = data_Education.drop([0]).reset_index().drop(columns=["index"])
data_Education = data_Education.reset_index().rename(columns={"index": "edu_id"})
data_Education.edu_id = data_Education.edu_id+1
data_Education

   edu_id                   edu_title
0       1         Bachelors (4 years)
1       2  None (no degree completed)
2       3                     Masters
3       4        Associates (2 years)
4       5               Doctorate/PhD

In [15]:
#appele to_sql pour inserer des donnees dans df data_Education à table 'education
data_Education.to_sql('education', if_exists='append', con=engine, index=False)

In [16]:
result_select_edu = pd.read_sql_query('SELECT * FROM education', engine)
result_select_edu

   edu_id                   edu_title
0       1         Bachelors (4 years)
1       2  None (no degree completed)
2       3                     Masters
3       4        Associates (2 years)
4       5               Doctorate/PhD

In [17]:
#prepare les donnees à inserer dans la table job
jobTitle = df_sondage['JobTitle']
data_Job = pd.DataFrame({"job_name": jobTitle})
data_Job = data_Job.drop_duplicates().reset_index().drop(columns=["index"])
data_Job = data_Job.reset_index().rename(columns={"index": "job_id"})
data_Job.job_id = data_Job.job_id+1
data_Job

    job_id                                           job_name
0        1  Developer: Business Intelligence (SSRS, PowerB...
1        2  DBA (Production Focus - build & troubleshoot s...
2        3  DBA (General - splits time evenly between writ...
3        4                                            Manager
4        5                  Developer: App code (C#, JS, etc)
5        6                                   Developer: T-SQL
6        7                                          Architect
7        8  DBA (Development Focus - tunes queries, indexe...
8        9                                           Engineer
9       10                                            Analyst
10      11                                              Other
11      12                                     Data Scientist
12      13                                                DBA
13      14                        Principal database engineer
14      15                   DevOps, Sr Software Engineer DBA
15      16                                        Technician
16      17                                Database Specialist
17      18                                         Consultant
18      19                              Systems Administrator
19      20                                              Sales
20      21                                 DBA / BI Developer
21      22                                     Sr Consultant
22      23                               Analytics consultant

In [18]:
# inserer à table job
data_Job.to_sql('job', if_exists='append', con=engine, index=False)

DataError: (pymysql.err.DataError) (1406, "Data too long for column 'job_name' at row 3")
[SQL: INSERT INTO job (job_id, job_name) VALUES (%(job_id)s, %(job_name)s)]
[parameters: ({'job_id': 1, 'job_name': 'Developer: Business Intelligence (SSRS, PowerBI, etc)'}, {'job_id': 2, 'job_name': 'DBA (Production Focus - build & troubleshoot servers, HA/DR)'}, {'job_id': 3, 'job_name': 'DBA (General - splits time evenly between writing & tuning queries AND building & troubleshooting servers)'}, {'job_id': 4, 'job_name': 'Manager'}, {'job_id': 5, 'job_name': 'Developer: App code (C#, JS, etc)'}, {'job_id': 6, 'job_name': 'Developer: T-SQL'}, {'job_id': 7, 'job_name': 'Architect'}, {'job_id': 8, 'job_name': 'DBA (Development Focus - tunes queries, indexes, does deployments)'}  ... displaying 10 of 23 total bound parameter sets ...  {'job_id': 22, 'job_name': 'Sr Consultant '}, {'job_id': 23, 'job_name': 'Analytics consultant'})]
(Background on this error at: http://sqlalche.me/e/14/9h9h)

In [7]:
result_select_job = pd.read_sql_query('SELECT * FROM job', engine)
result_select_job

    job_id                                           job_name
0        1  Developer: Business Intelligence (SSRS, PowerB...
1        2  DBA (Production Focus - build & troubleshoot s...
2        3  DBA (General - splits time evenly between writ...
3        4                                            Manager
4        5                  Developer: App code (C#, JS, etc)
5        6                                   Developer: T-SQL
6        7                                          Architect
7        8  DBA (Development Focus - tunes queries, indexe...
8        9                                           Engineer
9       10                                            Analyst
10      11                                              Other
11      12                                     Data Scientist
12      13                                                DBA
13      14                        Principal database engineer
14      15                   DevOps, Sr Software Engineer DBA
15      16                                        Technician
16      17                                Database Specialist
17      18                                         Consultant
18      19                              Systems Administrator
19      20                                              Sales
20      21                                 DBA / BI Developer
21      22                                     Sr Consultant
22      23                               Analytics consultant

In [20]:
#preparer les donneer à table employment_sector
Sector = df_sondage['EmploymentSector']
data_Employment_Sector = pd.DataFrame({"sec_name": Sector})
data_Employment_Sector = data_Employment_Sector.drop_duplicates().reset_index()
data_Employment_Sector = data_Employment_Sector.drop(columns=["index"])
data_Employment_Sector = data_Employment_Sector.reset_index()
data_Employment_Sector = data_Employment_Sector.rename(columns={"index": "sec_id"})
data_Employment_Sector.sec_id = data_Employment_Sector.sec_id+1
data_Employment_Sector

   sec_id                               sec_name
0       1                       Private business
1       2  Education (K-12, college, university)
2       3              State/province government
3       4                       Local government
4       5                             Non-profit
5       6                     Federal government
6       7                                Student

In [21]:
#inserer à table employment_sector
data_Employment_Sector.to_sql('employment_sector', if_exists='append', con=engine, index=False)

In [22]:
#preparer des donnees à inserer la table largest_city
population = df_sondage['PopulationOfLargestCityWithin20Miles']
data_largest_city = pd.DataFrame({"pop_name": population})
data_largest_city = data_largest_city.drop_duplicates().reset_index().drop([5])
data_largest_city = data_largest_city.drop(columns=["index"])
data_largest_city = data_largest_city.reset_index()
data_largest_city = data_largest_city.rename(columns={"index": "pop_id"})
data_largest_city.pop_id = data_largest_city.pop_id+1
data_largest_city

   pop_id              pop_name
0       1      <= 20,000 (town)
1       2      1M+ (metropolis)
2       3  300K-1M (large city)
3       4      100K-299K (city)
4       5  20K-99K (large town)

In [23]:
data_largest_city.to_sql('largest_city', if_exists='append', con=engine, index=False)

In [24]:
#preparer les donnees à inserer dans la table looking_job
lookingJob = df_sondage['LookingForAnotherJob']
data_looking_Job = pd.DataFrame({"look_job": lookingJob})
data_looking_Job = data_looking_Job.drop_duplicates().drop([0]).reset_index()
data_looking_Job = data_looking_Job.drop(columns=["index"])
data_looking_Job = data_looking_Job.reset_index()
data_looking_Job = data_looking_Job.rename(columns={"index": "look_id"})
data_looking_Job.look_id = data_looking_Job.look_id + 1
data_looking_Job

   look_id                                  look_job
0        1                                        No
1        2    Yes, but only passively (just curious)
2        3  Yes, actively looking for something else

In [25]:
#appel fonction pour inserer les données de df data_looking_Job à looking_job
data_looking_Job.to_sql('looking_job', if_exists='append', con=engine, index=False)

In [26]:
#preparer les données pour la table carreer_plan
#donnees d'origin est dans le col CareerPlansThisYear
carrierPlan = df_sondage['CareerPlansThisYear']
data_Carreer_Plan = pd.DataFrame({"cap_plan": carrierPlan})
data_Carreer_Plan = data_Carreer_Plan.drop_duplicates().reset_index()
data_Carreer_Plan = data_Carreer_Plan.drop(columns=["index"])
data_Carreer_Plan = data_Carreer_Plan.reset_index()
data_Carreer_Plan = data_Carreer_Plan.rename(columns={"index": "cap_id"})
data_Carreer_Plan = data_Carreer_Plan.drop([5])
data_Carreer_Plan.cap_id = data_Carreer_Plan.cap_id + 1
data_Carreer_Plan

   cap_id                                        cap_plan
0       1          Stay with the same employer, same role
1       2                               Prefer not to say
2       3                 Change both employers and roles
3       4   Stay with the same role, but change employers
4       5  Stay with the same employer,  but change roles

In [27]:
#inserer donnees à la table career_plan
data_Carreer_Plan.to_sql('carreer_plan', if_exists='append', con=engine, index=False)

In [28]:
#traiter des données à inserer dans table certification
certificat = df_sondage['Certifications']
data_certification = pd.DataFrame({"cert_name": certificat})
data_certification = data_certification.drop_duplicates().reset_index()
data_certification = data_certification.drop([0])
data_certification = data_certification.drop(columns=["index"])
data_certification = data_certification.reset_index()
data_certification = data_certification.rename(columns={"index": "cert_id"})
#data_certification.cert_id = data_certification.cert_id + 1
data_certification

   cert_id                         cert_name
0        1                  No, I never have
1        2  Yes, and they're currently valid
2        3             Yes, but they expired

In [29]:
#inserer les donnees du df data_certification à table certification
data_certification.to_sql('certification', if_exists='append', con=engine, index=False)

In [30]:
#preparer les donnees pour la table how_many_companies
#les donnees proviennent du col HowManyCompanies
nbCompany = df_sondage['HowManyCompanies'].astype(str)
data_Nb_Company = pd.DataFrame({'mcp_many_companies': nbCompany})
data_Nb_Company = data_Nb_Company.drop_duplicates().reset_index()
data_Nb_Company = data_Nb_Company.drop([6])
data_Nb_Company = data_Nb_Company.drop(columns=["index"])
data_Nb_Company = data_Nb_Company.sort_values(by=['mcp_many_companies'])
data_Nb_Company = data_Nb_Company.reset_index()
data_Nb_Company = data_Nb_Company.rename(columns={"index": "mcp_id"})
data_Nb_Company.mcp_id = data_Nb_Company.mcp_id + 1
data_Nb_Company

   mcp_id                                 mcp_many_companies
0       1  1 (this is the only company where I've had thi...
1       4  2 (I worked at another similar position elsewh...
2       5                                                  3
3       3                                                  4
4       2                                                  5
5       6                                          6 or more

In [32]:
#inserer les donnees à table how_many_companies
#alter table: mcp_many_companies VARCHAR(70)
data_Nb_Company.to_sql('how_many_companies', if_exists='append', con=engine, index=False)

In [33]:
#preparer les donnees à inserer à employement_status
employementStatus = df_sondage['EmploymentStatus']
data_Employement_Status = pd.DataFrame({'emp_status': employementStatus})
data_Employement_Status = data_Employement_Status.drop_duplicates().reset_index()
data_Employement_Status = data_Employement_Status.drop(columns=["index"])
data_Employement_Status = data_Employement_Status.reset_index()
data_Employement_Status = data_Employement_Status.rename(columns={"index": "emp_id"})
data_Employement_Status.emp_id = data_Employement_Status.emp_id + 1
data_Employement_Status

   emp_id                                         emp_status
0       1                                 Full time employee
1       2  Full time employee of a consulting/contracting...
2       3  Independent consultant, contractor, freelancer...
3       4                                          Part time
4       5         Independent or freelancer or company owner

In [35]:
#inserer les donnees du df data_Employement_Status à table employment_status
# alter table: emp_status VARCHAR(70)
data_Employement_Status.to_sql('employment_status', if_exists='append', con=engine, index=False)

In [36]:
#traiter les donnees dans le col KindsOfTasksPerformed
#pour avoir une list de task
kindOfTask = df_sondage['KindsOfTasksPerformed']
df_KindOfTask = pd.DataFrame({'list_status': kindOfTask}).drop_duplicates().dropna()
df_KindOfTask = df_KindOfTask.drop([0])
df_KindOfTask = df_KindOfTask.reset_index()
#calculer la longeur d'une chaines character du col list_status
df_KindOfTask['len'] = df_KindOfTask.apply (lambda row: len(row.list_status),axis=1)
df_KindOfTask = df_KindOfTask.sort_values(by=['len'])
df_KindOfTask = df_KindOfTask.drop(columns=["index"])
df_KindOfTask = df_KindOfTask.reset_index()

df_KindOfTask

     index                                        list_status  len
0      141                                                R&D    3
1       47                                           Projects    8
2      111                                       Manual tasks   12
3       87                                      Projects, R&D   13
4      103                                   On-call 24/7/365   16
..     ...                                                ...  ...
205    179  Build scripts & automation tools, Manual tasks...  137
206    123  Build scripts & automation tools, Meetings & m...  138
207    151  Build scripts & automation tools, Manual tasks...  142
208    127  Build scripts & automation tools, Manual tasks...  147
209     34  Build scripts & automation tools, Manual tasks...  152

[210 rows x 3 columns]

In [39]:
#recuperer une chaine du charactere dont la longeur est maximale
maxTask = df_KindOfTask['list_status'].loc[209]
#la decouper en liste
list_Task = maxTask.split(",")
print(list_Task)

['Build scripts & automation tools', ' Manual tasks', ' Meetings & management', ' On-call as part of a rotation', ' On-call 24/7/365', ' Projects', ' R&D', ' Training/teaching']

In [40]:
#construire un df du task
data_Task = pd.DataFrame({'tas_name': list_Task})
data_Task = data_Task.reset_index()
data_Task = data_Task.rename(columns={'index': 'tas_id'})
data_Task.tas_id = data_Task.tas_id + 1
data_Task

   tas_id                          tas_name
0       1  Build scripts & automation tools
1       2                      Manual tasks
2       3             Meetings & management
3       4     On-call as part of a rotation
4       5                  On-call 24/7/365
5       6                          Projects
6       7                               R&D
7       8                 Training/teaching

In [41]:
#inserer des donnees du df data_Task à table task
data_Task.to_sql('task', if_exists='append', con=engine, index=False)

In [45]:
a = {
    'MS_SQL_SERVER' : 'microsoft sql server|ms sql server|ssrs',
    'MS_APS' : 'parallel data ?warehouse|pdw|aps|azure dw|azure data ?warehouse',
    'POSTGRE_SQL' : 'postgresql|enterprisedb',
    'AZURE_DATA_LAKE' : 'data lake',
    'AZURE_SQL_DB' : 'azure',
    'MICROSOFT_ACCESS' : 'microsoft access',
    'ORACLE' : 'oracle',
    'MYSQL' : 'mysql/mariadb',
    'AMAZON_RDS' : 'amazon rds',
    'MONGO_DB' : 'mongodb',
    'IBM_DB2' : 'db2|udb|as ?400',
    'IBM_NETEZZA' : 'netezza',
    'CASSANDRA' : 'cassandra',
    'SQLITE' : 'sqlite|db3',
    'SAP' : 'sap',
    'TERADATA' : 'teradata',
    'ELASTIC_SEARCH' : 'elasticsearch',
    'COSMO_DB' : 'cosmosdb',
    'RAVEN_DB' : 'raven ?db',
    'SNOWFLAKE' : 'snowflake',
    'HADOOP' : 'hadoop|hdfs',
    'FIREBIRD' : 'firebird',
    'FIREBOLT' : 'firebolt',
    'BIGQUERY' : 'big ?query|gbq',
    'REDIS' : 'redis',
    'AMAZON_REDSHIFT' : 'redshift',
    'AMAZON_AURORA' : 'aurora|aws',
    'COUCH_DB' : 'co[a|u]chdb',
    'INFORMIX' : 'informix',
    'PROGRESS' : 'progress|4gl|open ?edge',
    'SYBASE' : 'sybase',
    'INGRES' : 'ingres|actian',
    'PROVIDEX' : 'providex',
    'APACHE_MAPR' : 'mapr',
    'TIBCO_GRAPH_DB' : 'tibco',
    'VECTOR_WISE' : 'informatica',
    'ORACLE_BERKELEY' : 'berkeley',
    'QLIK_SENSE' : 'qix',
    'ADABAS' : 'adabas',
    'COUCHBASE' : 'couch ?base',
    'FOXPRO' : 'foxpro',
    'EXASOL' : 'exasol',
    'INTERBASE' : 'interbase',
    'PERVASIVE' : 'pervasive',
    'RIAK' : 'riak',
    'DATACOM' : 'datacom',
    'GREENPLUM' : 'greenplum',
    'VERTICA' : 'vertica',
    'SAP_HANA' : 'hana',
    'PARADOX' : 'paradox',
    'GRUPTA_SQLBASE' : 'sql ?base',
    'DYNAMO_DB' : 'dynamo',
    'MULTICS_RDS' : 'multics',
    'CITRIX' : 'citrix',
    'ALPHAFOUR' : 'alpha ?four',
    'ROCKET_UNIDATA' : 'unidata',
    'ROCKET_UNIVERSE' : 'universe',
    'RAIMA_DBVISTA' : 'raima|dbvista',
    'AMAZON_DOCUMENT_DB' : 'documentdb',
    'NEO4J' : 'neo4j',
    'PICK_OS' : 'pick',
    'ADS_DB' : 'advantage|ads',
    'IBM_NOTES_DOMINO' : 'domino',
    'IBM_IMS' : 'ims',
    'H2_DB' : 'h2',
    'FOURD_DB' : '4d',
    'DATAEASE' : 'dataease',
    'GRAPH_DB' : 'graphdb',
    'MONET_DB' : 'monetdb',
    'MARKLOGIC' : 'marklogic',
    'KYLIN' : 'kylin',
    'HPCC' : 'hpcc',
    'LITE_DB' : 'litedb',
    'APACHE_IMPALA' : 'impala',
    'PERVASIVE_BTRIEVE' : 'btrieve',
    'MEMSQL' : 'memsql|singlestore',
    'UNISYS' : 'unisys',
    'INFLUX_DB' : 'i[n|m]flux',
    'SQL_ANYWHERE' : 'sql ?anywhere',
    'SPARK' : 'spark',
    'COCKROACH' : 'cockroach',
    'GOOGLE_SPANNER' : 'spanner',
    'GOOGLE_CLOUD_SQL' : 'google|gcp',
    'SCADA' : 'scada',
    'GPU_DB' : 'kinetica',
    'EXTREME_DB' : 'extremedb',
    'ARANGO_DB' : 'arango',
    'ROCKS_DB' : 'rocks',
    'CLIPPER' : 'clipper',
    'DRUID' : 'druid',
    'PRESTO_DB' : 'presto',
    'CLOUDERA_OP_DB' : 'cloudera',
    'FILEMAKER' : 'filemaker',
    'APACHE_SOLR' : 'solr',
    'APACHE_KAFKA' : 'kafka',
    'APACHE_IGNITE' : 'ignite',
    'APACHE_HBASE' : 'hbase',
    'APACHE_PARQUET' : 'parquet',
    'APACHE_KUDU' : 'kudu',
    'ALTIBASE' : 'altibase',
    'SPLUNK' : 'splunk',
    'SALESFORCE' : 'salesforce',
    'APACHE_DELTA' : 'delta lake',
    'APACHE_DERBY' : 'derby',
    'DATABRICKS' : 'databricks',
    'CLICKHOUSE' : 'clickhouse',
    'ORACLE_ESSBASE' : 'essbase|hyperion',
    'ORIENT_DB' : 'orientdb',
    'INTERSYSTEMS_CACHE' : 'intersystems|cach.',
    'IBM_COGNOS' : 'tm1',
    'IBM_REDBRICK' : 'red ?brick',
    'IBM_FOCUS' : 'focus',
    'DB4O' : 'db4',
    'MUMPS' : 'mumps',
    'HIVE' : 'hive|llap|hdinsight',
    'NONSTOP_SQL' : 'hp tandem',
    'CISCO' : 'cisco',
    'JADE' : 'jade',
    'CLUSTRIX' : 'clustrix',
    'RDB' : 'rdb',
    'MS_COSMOS_DB' : 'cosmo',
    'IDMS' : 'idms',
    'SAS' : 'sas',
    'DBASE' : 'dbase',
    'OTHER' : 'other',

}

In [47]:
data_Database = pd.DataFrame.from_dict(a,orient = 'index')
data_Database = data_Database.reset_index()
data_Database = data_Database.reset_index()
data_Database = data_Database.rename(columns={'index':'db_name', 'level_0': 'db_id'})
data_Database

     db_id          db_name                                                  0
0        0    MS_SQL_SERVER            microsoft sql server|ms sql server|ssrs
1        1           MS_APS  parallel data ?warehouse|pdw|aps|azure dw|azur...
2        2      POSTGRE_SQL                            postgresql|enterprisedb
3        3  AZURE_DATA_LAKE                                          data lake
4        4     AZURE_SQL_DB                                              azure
..     ...              ...                                                ...
120    120     MS_COSMOS_DB                                              cosmo
121    121             IDMS                                               idms
122    122              SAS                                                sas
123    123            DBASE                                              dbase
124    124            OTHER                                              other

[125 rows x 3 columns]

In [48]:
data_Database = data_Database.drop(0, axis=1)
data_Database.db_id = data_Database.db_id + 1
data_Database

     db_id          db_name
0        1    MS_SQL_SERVER
1        2           MS_APS
2        3      POSTGRE_SQL
3        4  AZURE_DATA_LAKE
4        5     AZURE_SQL_DB
..     ...              ...
120    121     MS_COSMOS_DB
121    122             IDMS
122    123              SAS
123    124            DBASE
124    125            OTHER

[125 rows x 2 columns]

In [49]:
data_Database.to_sql('database', if_exists='append', con=engine, index=False)